NORMAL_LIST = [
    "凌阳",
    "安可",
    "卡卡罗",
    "鉴心",
    "维里奈",
    "漂泊者",
    "漂泊者·衍射",
    "漂泊者·湮灭",
    "漂泊者·气动",
    "千古洑流",
    "停驻之烟",
    "擎渊怒涛",
    "漪澜浮录",
    "浩境粼光",
    "源能机锋",
    "镭射切变",
    "相位涟漪",
    "脉冲协臂",
    "玻色星仪",
]

NORMAL_LIST_IDS = [1104, 1203, 1301, 1405, 1503]

card_sort_map = {
    "生命": "0",
    "攻击": "0",
    "防御": "0",
    "共鸣效率": "0%",
    "偏谐值累积效率": "0%",
    "暴击": "0.0%",
    "暴击伤害": "0.0%",
    "属性伤害加成": "0.0%",
    "治疗效果加成": "0.0%",
    "普攻伤害加成": "0.0%",
    "重击伤害加成": "0.0%",
    "共鸣技能伤害加成": "0.0%",
    "共鸣解放伤害加成": "0.0%",
}

ATTRIBUTE_ID_MAP = {0: "物理", 1: "冷凝", 2: "热熔", 3: "导电", 4: "气动", 5: "衍射", 6: "湮灭"}
ATTRIBUTE_NAME_SET = set(ATTRIBUTE_ID_MAP.values())
WEAPON_TYPE_ID_MAP = {1: "长刃", 2: "迅刀", 3: "佩枪", 4: "臂铠", 5: "音感仪"}
DEAFAULT_WEAPON_ID = {1: 21010011, 2: 21020011, 3: 21030011, 4: 21040011, 5: 21050011}
SKILL_MAP = {
    "常态攻击": "1",
    "共鸣技能": "2",
    "共鸣回路": "7",
    "共鸣解放": "3",
    "变奏技能": "6",
    "延奏技能": "8",
    "谐度破坏": "17",
}

SPECIAL_CHAR = {
    "1501": ["1501", "1502"],  # 光主
    "1502": ["1501", "1502"],
    "1604": ["1604", "1605"],  # 暗主
    "1605": ["1604", "1605"],
    "1406": ["1406", "1408"],  # 风主
    "1408": ["1406", "1408"],
}

SPECIAL_CHAR_INT = {
    1501: [1501, 1502],  # 光主
    1502: [1501, 1502],
    1604: [1604, 1605],  # 暗主
    1605: [1604, 1605],
    1406: [1406, 1408],  # 风主
    1408: [1406, 1408],
}

SPECIAL_CHAR_INT_ALL = [1501, 1502, 1604, 1605, 1406, 1408]

SPECIAL_CHAR_NAME = {
    "1501": "光主",
    "1502": "光主",
    "1604": "暗主",
    "1605": "暗主",
    "1406": "风主",
    "1408": "风主",
}
SPECIAL_CHAR_ID = {
    "漂泊者·衍射·男": "1501",
    "漂泊者·衍射·女": "1502",
    "漂泊者·湮灭·男": "1605",
    "漂泊者·湮灭·女": "1604",
    "漂泊者·气动·男": "1406",
    "漂泊者·气动·女": "1408",
}
ID_FULL_CHAR_NAME = {
    "1501": "漂泊者·衍射",
    "1502": "漂泊者·衍射",
    "1604": "漂泊者·湮灭",
    "1605": "漂泊者·湮灭",
    "1406": "漂泊者·气动",
    "1408": "漂泊者·气动",
}

NAME_ALIAS = {"漂泊者·湮灭": "暗主", "漂泊者·衍射": "光主", "漂泊者·气动": "风主"}


SHORT_NAME = {6000106: "芙露德莉斯", 6000167: "利维亚坦", 6000116: "芬莱克"}


def get_short_name(sonata_id: int, sonata_name: str) -> str:
    return SHORT_NAME.get(sonata_id, sonata_name)


# id2name
CHAR_DETAIL = {
    "1304": {"name": "今汐", "fetterDetail": "浮星祛暗"},
    "1604": {"sex": "女", "name": "漂泊者·湮灭", "fetterDetail": "沉日劫明"},
    "1303": {"name": "渊武", "fetterDetail": "高天共奏之曲"},
    "1105": {"name": "折枝", "fetterDetail": "高天共奏之曲"},
    "1505": {"name": "守岸人", "fetterDetail": "隐世回光"},
    "1605": {"sex": "男", "name": "漂泊者·湮灭", "fetterDetail": "沉日劫明"},
    "1205": {"name": "长离", "fetterDetail": "熔山裂谷"},
    "1506": {"name": "菲比", "needId": 6000104, "fetterDetail": "此间永驻之光"},
    "1104": {"name": "凌阳", "fetterDetail": "凝夜白霜"},
    "1203": {"name": "安可", "fetterDetail": "熔山裂谷"},
    "1302": {"name": "吟霖", "fetterDetail": "高天共奏之曲"},
    "1502": {"sex": "女", "name": "漂泊者·衍射", "fetterDetail": "此间永驻之光"},
    "1405": {"name": "鉴心", "fetterDetail": "啸谷长风"},
    "1103": {"name": "白芷", "fetterDetail": "隐世回光"},
    "1106": {"name": "釉瑚", "fetterDetail": "隐世回光"},
    "1202": {"name": "炽霞", "fetterDetail": "熔山裂谷"},
    "1503": {"name": "维里奈", "fetterDetail": "隐世回光"},
    "1606": {"name": "洛可可", "fetterDetail": "幽夜隐匿之帷"},
    "1102": {"name": "散华", "fetterDetail": "轻云出月"},
    "1301": {"name": "卡卡罗", "fetterDetail": "彻空冥雷"},
    "1403": {"name": "秋水", "fetterDetail": "啸谷长风"},
    "1601": {"name": "桃祈", "fetterDetail": "轻云出月"},
    "1602": {"name": "丹瑾", "fetterDetail": "沉日劫明"},
    "1305": {"name": "相里要", "fetterDetail": "彻空冥雷"},
    "1204": {"name": "莫特斐", "fetterDetail": "高天共奏之曲"},
    "1107": {"name": "珂莱塔", "fetterDetail": "凌冽决断之心"},
    "1504": {"name": "灯灯", "fetterDetail": "轻云出月"},
    "1603": {"name": "椿", "fetterDetail": "沉日劫明"},
    "1501": {"sex": "男", "name": "漂泊者·衍射", "fetterDetail": "此间永驻之光"},
    "1404": {"name": "忌炎", "fetterDetail": "啸谷长风"},
    "1402": {"name": "秧秧", "fetterDetail": "轻云出月"},
    "1206": {"name": "布兰特", "fetterDetail": "无惧浪涛之勇"},
    "1408": {"sex": "女", "name": "漂泊者·气动", "fetterDetail": "流云逝尽之空"},
    "1406": {"sex": "男", "name": "漂泊者·气动", "fetterDetail": "流云逝尽之空"},
    "1607": {"name": "坎特蕾拉", "fetterDetail": "幽夜隐匿之帷"},
    "1507": {"name": "赞妮", "needId": 6000104, "fetterDetail": "此间永驻之光"},
    "1407": {"name": "夏空", "fetterDetail": "流云逝尽之空"},
    "1409": {"name": "卡提希娅", "fetterDetail": "愿戴荣光之旅"},
    "1207": {"name": "露帕", "fetterDetail": "奔狼燎原之焰"},
    "1608": {"name": "弗洛洛", "fetterDetail": {"失序彼岸之梦": 3, "幽夜隐匿之帷": 2}},
    "1306": {"name": "奥古斯塔", "fetterDetail": {"荣斗铸锋之冠": 3, "彻空冥雷": 2}},
    "1410": {"name": "尤诺", "needId": 6000160, "fetterDetail": {"荣斗铸锋之冠": 3, "啸谷长风": 2}},
    "1411": {"name": "仇远", "fetterDetail": {"息界同调之律": 3, "啸谷长风": 2}},
    "1208": {"name": "嘉贝莉娜", "needId": 6000120, "fetterDetail": {"焚羽猎魔之影": 3, "奔狼燎原之焰": 2}},
    "1307": {"name": "卜灵", "fetterDetail": "隐世回光"},
    "1508": {"name": "千咲", "fetterDetail": {"命理崩毁之弦": 3, "沉日劫明": 2}},
    "1509": {"name": "琳奈", "fetterDetail": "逆光跃彩之约"},
    "1209": {"name": "莫宁", "fetterDetail": "星构寻辉之环"},
    "1510": {"name": "陆·赫斯", "needId": 6000180, "fetterDetail": "流金溯真之式"},
    "1210": {"name": "爱弥斯", "fetterDetail": "长路启航之星"},
}

# 首位buff
# 4cost
SONATA_COST_4_ID = {
    "凝夜白霜": [6000044, 6000085],
    "熔山裂谷": [6000091, 390080007, 6000085],
    "彻空冥雷": [390080003, 6000039, 6000088, 6000089, 6000085],
    "啸谷长风": [6000086, 6000043, 6000085],
    "浮星祛暗": [6000059, 6000045, 6000085],
    "沉日劫明": [6000090, 6000053, 6000042, 6000085],
    "隐世回光": [6000060, 390080005],
    "轻云出月": [6000052, 390080005],
    "不绝余音": [6000048],
    "凌冽决断之心": [6000083, 6000105],
    "高天共奏之曲": [6000085, 6000089, 6000105],
    "幽夜隐匿之帷": [6000082, 6000087],
    "此间永驻之光": [6000092],
    "无惧浪涛之勇": [6000084],
    "流云逝尽之空": [6000106, 6000113],
    "愿戴荣光之旅": [6000106, 6000113],
    "奔狼燎原之焰": [6000114],
    "失序彼岸之梦": [6000115, 6000116],
    "荣斗铸锋之冠": [6000121, 6000160],
    "息界同调之律": [6000116],
    "焚羽猎魔之影": [6000167],
    "命理崩毁之弦": [6000167],
    "逆光跃彩之约": [6000189],
    "流金溯真之式": [6000189],
    "星构寻辉之环": [6000190],
    "长路启航之星": [6000191],
    "斑驳粉饰之沫": [6000190],
    "听唤语义之愿": [6000192],
}

# 3cost
SONATA_COST_3_ID = {
    "凝夜白霜": [],
    "熔山裂谷": [],
    "彻空冥雷": [],
    "啸谷长风": [],
    "浮星祛暗": [],
    "沉日劫明": [],
    "隐世回光": [],
    "轻云出月": [],
    "不绝余音": [],
    "凌冽决断之心": [6000076],
    "高天共奏之曲": [6000076, 6000080],
    "幽夜隐匿之帷": [],
    "此间永驻之光": [6000104, 6000080],
    "无惧浪涛之勇": [],
    "流云逝尽之空": [6000104],
    "愿戴荣光之旅": [6000104, 6000112],
    "奔狼燎原之焰": [6000112, 6000120],
    "失序彼岸之梦": [],
    "荣斗铸锋之冠": [],
    "息界同调之律": [],
    "焚羽猎魔之影": [6000120],
    "命理崩毁之弦": [],
    "逆光跃彩之约": [],
    "流金溯真之式": [6000179, 6000180],
    "星构寻辉之环": [],
    "长路启航之星": [6000180],
    "斑驳粉饰之沫": [6000179],
    "听唤语义之愿": [6000180],
}

# 1cost
SONATA_COST_1_ID = {
    "凝夜白霜": [],
    "熔山裂谷": [],
    "彻空冥雷": [],
    "啸谷长风": [],
    "浮星祛暗": [],
    "沉日劫明": [],
    "隐世回光": [],
    "轻云出月": [],
    "不绝余音": [],
    "凌冽决断之心": [],
    "高天共奏之曲": [],
    "幽夜隐匿之帷": [],
    "此间永驻之光": [],
    "无惧浪涛之勇": [],
    "流云逝尽之空": [],
    "愿戴荣光之旅": [],
    "奔狼燎原之焰": [],
    "失序彼岸之梦": [],
    "荣斗铸锋之冠": [],
    "息界同调之律": [],
    "焚羽猎魔之影": [],
    "命理崩毁之弦": [],
    "逆光跃彩之约": [],
    "流金溯真之式": [],
    "星构寻辉之环": [],
    "长路启航之星": [],
    "斑驳粉饰之沫": [],
    "听唤语义之愿": [],
}
